Revit 2024 API
SpatialElementFromToCalculationPoints.MakeToPositionAcceptable Method
 This function takes a potential "to" point and converts it to be a similar point on the opposite side of the family's host from the "from" point if necessary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ MakeToPositionAcceptable(
	XYZ newToLocation
)
Visual Basic
Public Function MakeToPositionAcceptable ( _
	newToLocation As XYZ _
) As XYZ
Visual C++
public:
XYZ^ MakeToPositionAcceptable(
	XYZ^ newToLocation
)
Parameters
newToLocation
Type: Autodesk.Revit.DB.XYZ
 The desired "to" location
Return Value
 The valid "to" location.
Remarks
 If the point is already an acceptable "to" location then the original point will be returned. Otherwise, the point's X and Y will be projected onto the centerline of the family's host.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace